# 3 在新数据库中新建一张 user 表,插入几条数据,属性包含:唯一标识(id),姓名(name)性别(sex).年龄(age).联系方式(phone)

```sql
-- 创建新数据库
CREATE DATABASE IF NOT EXISTS new_database;

-- 切换到新数据库
USE new_database;

-- 创建user表
CREATE TABLE IF NOT EXISTS user (
    id INT AUTO_INCREMENT PRIMARY KEY,
    name VARCHAR(255) NOT NULL,
    sex VARCHAR(10),
    age INT,
    phone VARCHAR(20)
);

-- 插入数据
INSERT INTO user (name, sex, age, phone) VALUES
('John Doe', 'Male', 25, '123-456-7890'),
('Jane Smith', 'Female', 30, '987-654-3210'),
('Bob Johnson', 'Male', 22, '555-123-4567');
```

# 4 写出 SQL语句,查询 user 表中所有年龄在 20-30 范围内的用户

```sql
SELECT * FROM user
WHERE age BETWEEN 20 AND 30;
```

# 5 写出 SQL 语句，删除 user 表中名字包含“张”的用户

```sql
DELETE FROM user
WHERE name LIKE '%张%';
```

# 6 写出 SQL 语句,计算 user 表中所有用户的平均年龄

```sql
SELECT AVG(age) AS average_age FROM user;
```

# 7 写出 SQL语句,查询 user 表中年龄在 20-30 范围内,名字包含“张”的用户,并按照年龄从大到小排序输出

```sql
SELECT * FROM user
WHERE age BETWEEN 20 AND 30
  AND name LIKE '%张%'
ORDER BY age DESC;
```

# 8 新建两张表team 表(id,teamName)和score 表(id,teamid,userid,score)。其中score 表中的 teamid 为指向 team表id 的外键，userid 为指向 user表id的外键

```sql
-- 创建 team 表
CREATE TABLE team (
    id INT PRIMARY KEY AUTO_INCREMENT,
    teamName VARCHAR(255) NOT NULL
);

-- 创建 score 表
CREATE TABLE score (
    id INT PRIMARY KEY AUTO_INCREMENT,
    teamid INT,
    userid INT,
    score INT,
    FOREIGN KEY (teamid) REFERENCES team(id),
    FOREIGN KEY (userid) REFERENCES user(id)
);
```

# 9 写出 SQL语句,查询 teamName 为“ECNU”的队伍中，年龄小于 20 的用户们。

```sql
-- 将 user 表、score 表和 team 表连接起来。然后，通过 WHERE 子句筛选出 teamName 为“ECNU”且年龄小于 20 的用户。
SELECT user.*
FROM user
JOIN score ON user.id = score.userid
JOIN team ON score.teamid = team.id
WHERE team.teamName = 'ECNU' AND user.age < 20;
```

# 10 写出 SQL 语句,计算 teamName为“ECNU”的总分(假设 score 存在 null值,nul值默认为 0 加入计算)。

```sql
-- 使用 COALESCE 函数将可能的 null 值转换为 0
SELECT team.teamName, COALESCE(SUM(score.score), 0) AS totalScore
FROM team
LEFT JOIN score ON team.id = score.teamid
WHERE team.teamName = 'ECNU'
GROUP BY team.teamName;
```